In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
s

a   -1.405202
b    0.709615
c    1.156916
d    0.697415
e   -0.336776
dtype: float64

In [3]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [4]:
pd.Series(np.random.randn(5))

0    0.612287
1   -0.144223
2    0.575966
3   -0.852018
4    0.614527
dtype: float64

In [5]:
d = {'b':1, 'a':0, 'c':2}
pd.Series(d)

b    1
a    0
c    2
dtype: int64

In [6]:
pd.Series(5., index=['a', 'b', 'c', 'd', 'e'])

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [7]:
s[0]

-1.4052018738412164

In [8]:
s[:3]

a   -1.405202
b    0.709615
c    1.156916
dtype: float64

In [9]:
s[s > s.median()]

b    0.709615
c    1.156916
dtype: float64

In [10]:
s[[4,3,1]]

e   -0.336776
d    0.697415
b    0.709615
dtype: float64

In [11]:
np.exp(s)

a    0.245318
b    2.033207
c    3.180112
d    2.008554
e    0.714068
dtype: float64

In [12]:
s.dtype

dtype('float64')

In [13]:
s.to_numpy()

array([-1.40520187,  0.70961451,  1.15691648,  0.69741516, -0.33677639])

In [14]:
s['a']

-1.4052018738412164

In [15]:
s['e']

-0.33677638792287234

In [16]:
s

a   -1.405202
b    0.709615
c    1.156916
d    0.697415
e   -0.336776
dtype: float64

In [17]:
'e' in s

True

In [18]:
'f' in s

False

In [19]:
s['f']

KeyError: 'f'

In [20]:
s + s

a   -2.810404
b    1.419229
c    2.313833
d    1.394830
e   -0.673553
dtype: float64

In [21]:
s * 2

a   -2.810404
b    1.419229
c    2.313833
d    1.394830
e   -0.673553
dtype: float64

In [22]:
np.exp(s)

a    0.245318
b    2.033207
c    3.180112
d    2.008554
e    0.714068
dtype: float64

In [23]:
s1 = s[1:]
s2 = s[:-1]
s1+s2

a         NaN
b    1.419229
c    2.313833
d    1.394830
e         NaN
dtype: float64

In [24]:
s = pd.Series(np.random.rand(5), name='something')

In [25]:
s

0    0.768331
1    0.372110
2    0.145267
3    0.695202
4    0.315340
Name: something, dtype: float64

In [26]:
s.name

'something'

In [28]:
d = {'one': pd.Series([1.,2.,3.], index=['a', 'b', 'c']), 'two': pd.Series([1.,2.,3.,4.], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [30]:
pd.DataFrame(d, index=['d', 'b', 'a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [33]:
pd.DataFrame(d, index=['d', 'b', 'a'], columns=['two','three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [34]:
d = {'one':[1.,2.,3.,4.], 'two':[4.,3.,2.,1.]}
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [35]:
pd.DataFrame(d, index=['a','b','d','d'])

   one  two
a  1.0  4.0
b  2.0  3.0
d  3.0  2.0
d  4.0  1.0

In [36]:
pd.DataFrame(pd.Series(np.random.randn(5), name='something'))

   something
0  -0.916838
1  -0.167298
2  -0.969569
3   0.727050
4   2.457354

In [37]:
df['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [38]:
df['three'] = df['one'] * df['two']

In [39]:
df['flag'] = df['one']>2
df

   one  two  three   flag
a  1.0  1.0    1.0  False
b  2.0  2.0    4.0  False
c  3.0  3.0    9.0   True
d  NaN  4.0    NaN  False

In [40]:
del df['two']

In [41]:
df

   one  three   flag
a  1.0    1.0  False
b  2.0    4.0  False
c  3.0    9.0   True
d  NaN    NaN  False

In [42]:
df['foo'] = 'bar'

In [43]:
df

   one  three   flag  foo
a  1.0    1.0  False  bar
b  2.0    4.0  False  bar
c  3.0    9.0   True  bar
d  NaN    NaN  False  bar

In [44]:
df['one_trunc'] = df['one'][:2]
df

   one  three   flag  foo  one_trunc
a  1.0    1.0  False  bar        1.0
b  2.0    4.0  False  bar        2.0
c  3.0    9.0   True  bar        NaN
d  NaN    NaN  False  bar        NaN

In [50]:
df = pd.DataFrame(np.random.randn(8,3), columns=list('ABC'))
df

          A         B         C
0  1.275627  0.506784  0.316789
1  1.351765 -0.791257  0.901804
2 -0.173956 -0.964743  0.821022
3  0.550161 -0.707317 -1.460745
4  0.040189  0.805427  1.620430
5 -0.724203  0.392225 -0.668390
6  0.740176 -1.969961 -1.108319
7 -0.143274  1.050627  0.254403

In [51]:
df*5+2

          A         B          C
0  8.378133  4.533919   3.583944
1  8.758823 -1.956284   6.509019
2  1.130218 -2.823715   6.105109
3  4.750805 -1.536587  -5.303727
4  2.200947  6.027136  10.102148
5 -1.621014  3.961127  -1.341952
6  5.700879 -7.849807  -3.541594
7  1.283632  7.253135   3.272015

In [52]:
1/df

           A         B         C
0   0.783928  1.973228  3.156677
1   0.739774 -1.263812  1.108889
2  -5.748567 -1.036545  1.217994
3   1.817650 -1.413792 -0.684582
4  24.882143  1.241577  0.617120
5  -1.380828  2.549554 -1.496132
6   1.351030 -0.507624 -0.902267
7  -6.979655  0.951813  3.930771

In [53]:
df**4

          A          B         C
0  2.647856   0.065962  0.010071
1  3.338907   0.391985  0.661376
2  0.000916   0.866257  0.454379
3  0.091613   0.250298  4.553006
4  0.000003   0.420828  6.894783
5  0.275069   0.023667  0.199582
6  0.300151  15.060207  1.508894
7  0.000421   1.218413  0.004189

In [55]:
df1 = pd.DataFrame({'a':[1,0,1], 'b':[0,1,1]}, dtype=bool)
df2 = pd.DataFrame({'a':[0,1,1], 'b':[1,1,0]}, dtype=bool)

In [56]:
df1 & df2

       a      b
0  False  False
1  False   True
2   True  False

In [57]:
df1 | df2

      a     b
0  True  True
1  True  True
2  True  True

In [58]:
df1 ^ df2

       a      b
0   True   True
1   True  False
2  False   True

In [59]:
-df1

       a      b
0  False   True
1   True  False
2  False  False

In [61]:
dft = pd.DataFrame({'A': np.random.rand(3),
                   'B': 1,
                   'C': 'foo',
                   'D': pd.Timestamp('20010102'),
                   'E': pd.Series([1.0]*3).astype('float32'),
                   'F': False,
                   'G': pd.Series([1]*3, dtype='int8')})
dft

          A  B    C          D    E      F  G
0  0.188001  1  foo 2001-01-02  1.0  False  1
1  0.467307  1  foo 2001-01-02  1.0  False  1
2  0.065637  1  foo 2001-01-02  1.0  False  1

In [63]:
dft.dtypes

A           float64
B             int64
C            object
D    datetime64[ns]
E           float32
F              bool
G              int8
dtype: object

In [64]:
dft['A'].dtype

dtype('float64')

In [65]:
pd.Series([1,2,3,6., 'foo'])

0      1
1      2
2      3
3      6
4    foo
dtype: object

In [67]:
df1 = pd.DataFrame(np.random.randn(8,1), columns=['A'], dtype='float32')
df1.dtypes

A    float32
dtype: object

In [68]:
df1 = df1.astype('float64')

In [69]:
df1.dtypes

A    float64
dtype: object

In [70]:
dft1 = pd.DataFrame({'a':[1,0,1], 'b':[4,5,6], 'c':[7,8,9]})
dft1 = dft1.astype({'a':np.bool, 'c':np.float64})

In [72]:
dft1

       a  b    c
0   True  4  7.0
1  False  5  8.0
2   True  6  9.0

In [73]:
dft1.dtypes

a       bool
b      int64
c    float64
dtype: object